Repository: 0niel/university-app
Catalog: packages/neon/packages/neon_framework/lib/l10n/*.arb
Languages: ru

source: Nextcloud logo
ru: Логотип Nextcloud

# appImplementationName
source: {app, select, nextcloud{Nextcloud} core{Server} dashboard{Dashboard} files{Files} news{News} notes{Notes} notifications{Notifications} other{}}
ru: {app, select, nextcloud{Nextcloud} core{Сервер} dashboard{Дашборд} files{Файлы} news{Новости} notes{Заметки} notifications{Уведомления} other{}}

source: Login again
ru: Войти снова

# loginOpenAgain
source: Open again
ru: Открыть снова

# loginSwitchToBrowserWindow
source: Please switch to the browser window that just opened and proceed there
ru: Пожалуйста, переключитесь на вкладку браузера, которая только что открылась и продолжите там

# loginWorksWith
source: works with
ru: работает с

# loginUsingQRcode
source: Login using a QR code
ru: Вход по QR-коду

# loginUsingServerAddress
source: Login using the server address
ru: Вход с помощью адреса сервера

# loginCheckingServerVersion
source: Checking server version
ru: Проверка версии сервера

# loginSupportedServerVersion
source: Supported server version: {version}
ru: Поддерживаемая версия сервера: {version}

# loginUnsupportedServerVersion
source: Unsupported server version: {version}
ru: Неподдерживаемая версия сервера: {version}

# loginCheckingMaintenanceMode
source: Checking maintenance mode
ru: Проверка режима обслуживания

# loginMaintenanceModeEnabled
source: Maintenance mode enabled
ru: Режим обслуживания активен

# loginMaintenanceModeDisabled
source: Maintenance mode disabled
ru: Режим обслуживания отключен

# loginCheckingAccount
source: Checking account
ru: Проверка аккаунта

# errorCredentialsForAccountNoLongerMatch
source: The credentials for this account no longer match
ru: Данные для входа в этот аккаунт больше не подходят

# errorServerHadAProblemProcessingYourRequest
source: The server had a problem while processing your request. You might want to try again
ru: Сервер столкнулся с проблемой при обработке вашего запроса. Вы можете попробовать снова

# errorSomethingWentWrongTryAgainLater
source: Something went wrong. Please try again later
ru: Что-то пошло не так. Пожалуйста, попробуйте позже

# errorUnableToReachServer
source: Unable to reach the server
ru: Невозможно связаться с сервером

# errorUnableToReachServerAt
source: Unable to reach the server at {url}
ru: Невозможно связаться с сервером по адресу {url}

# errorConnectionTimedOut
source: Connection has timed out
ru: Время соединения истекло

# errorNoCompatibleNextcloudAppsFound
source: No compatible Nextcloud apps could be found. We are working hard to implement more and more apps!
ru: Совместимые приложения Nextcloud не найдены. Мы работаем над добавлением новых приложений!

# errorServerInMaintenanceMode
source: The server is in maintenance mode. Please try again later or contact the server admin.
ru: Сервер находится в режиме обслуживания. Попробуйте позже или свяжитесь с администратором сервера.

# errorMissingPermission
source: Permission for {name} is missing
ru: Недостает разрешения для {name}

# errorUnsupportedAppVersions
source: Sorry, the version of the following apps on your Nextcloud instance are not supported. {names} Please contact your administrator to resolve the issues.
ru: Извините, версии следующих приложений на вашем экземпляре Nextcloud не поддерживаются. {names} Пожалуйста, свяжитесь с вашим администратором для устранения проблем.

# errorEmptyField
source: This field can not be empty
ru: Это поле не может быть пустым

# errorInvalidURL
source: Invalid URL provided
ru: Некорректный URL

# errorInvalidQRcode
source: Invalid QR-Code provided
ru: Некорректный QR-код

# errorRouteNotFound
source: Route not found: {route}
ru: Путь не найден: {route}

# errorDialog
source: An error has occurred
ru: Произшла ошибка

# actionYes
source: Yes
ru: Да

# actionNo
source: No
ru: Нет

# actionClose
source: Close
ru: Закрыть

# actionRetry
source: Retry
ru: Повторить

# actionShowSlashHide
source: Show/Hide
ru: Показать/Скрыть

# actionExit
source: Exit
ru: Выход

# actionContinue
source: Continue
ru: Продолжить

# actionCancel
source: Cancel
ru: Отмена

# firstLaunchGoToSettingsToEnablePushNotifications
source: Go to the settings to enable push notifications
ru: Перейдите в настройки, чтобы включить push-уведомления

# nextPushSupported
source: NextPush is supported!
ru: NextPush поддерживается!

# nextPushSupportedText
source: NextPush is a FOSS way of receiving push notifications using the UnifiedPush protocol via a Nextcloud instance. You can install NextPush from the F-Droid app store.
ru: NextPush — это FOSS-способ получения push-уведомлений с использованием протокола UnifiedPush через экземпляр Nextcloud. Вы можете установить NextPush из магазина приложений F-Droid.

# nextPushSupportedInstall
source: Install NextPush
ru: Установить NextPush

source: Search
ru: Поиск

# searchCancel
source: Cancel search
ru: Отменить поиск

# searchNoResults
source: No search results
ru: Нет результатов поиска

source: Settings
ru: Настройки

# settingsApps
source: Apps
ru: Приложения

# settingsAccount
source: Account
ru: Аккаунт

# settingsAccountManage
source: Manage accounts
ru: Управление аккаунтами

# settingsExport
source: Export settings
ru: Экспорт настроек

# settingsImport
source: Import settings
ru: Импорт настроек

# settingsReset
source: Reset settings?
ru: Сбросить настройки?

# settingsImportWrongFileExtension
source: Settings import has wrong file extension (has to be .json.base64)
ru: Импорт настроек имеет неверное расширение файла (должно быть .json.base64)

# settingsResetAll
source: Reset all settings
ru: Сбросить все настройки

# settingsResetAllConfirmation
source: Do you want to reset all settings?
ru: Вы действительно хотите сбросить все настройки?

# settingsResetAllExplanation
source: This will reset all preferences back to their default settings.
ru: Это сбросит все настройки к их значениям по умолчанию.

# settingsResetFor
source: Reset all settings for {name}
ru: Сбросить все настройки для {name}

# settingsResetForExplanation
source: This will reset your account preferences back to their default settings.
ru: Это сбросит настройки вашего аккаунта к значениям по умолчанию.

# settingsResetForClientExplanation
source: This will reset all preferences for the app back to their default settings.
ru: Это сбросит все настройки приложения к значениям по умолчанию.

# settingsResetForConfirmation
source: Do you want to reset all settings for {name}?
ru: Вы действительно хотите сбросить все настройки для {name}?

# optionsCategoryGeneral
source: General
ru: Общие

# optionsCategoryTheme
source: Theme
ru: Тема

# optionsCategoryPushNotifications
source: Push notifications
ru: Push-уведомления

# optionsCategoryOther
source: Other
ru: Другое

# optionsCategoryAccounts
source: Accounts
ru: Аккаунты

# optionsCategoryStartup
source: Startup
ru: Запуск

# optionsCategoryNavigation
source: Navigation
ru: Навигация

# optionsSortOrderAscending
source: Ascending
ru: По возрастанию

# optionsSortOrderDescending
source: Descending
ru: По убыванию

# globalOptionsThemeMode
source: Theme mode
ru: Режим темы

# globalOptionsThemeModeLight
source: Light
ru: Светлая

# globalOptionsThemeModeDark
source: Dark
ru: Темная

# globalOptionsThemeModeAutomatic
source: Automatic
ru: Автоматически

# globalOptionsThemeOLEDAsDark
source: OLED theme as dark theme
ru: OLED-тема как темная тема

# globalOptionsThemeUseNextcloudTheme
source: Use Nextcloud theme
ru: Использовать тему Nextcloud

# globalOptionsThemeCustomBackground
source: Custom background
ru: Пользовательский фон

# globalOptionsPushNotificationsEnabled
source: Enabled
ru: Включены

# globalOptionsPushNotificationsEnabledDisabledNotice
source: No UnifiedPush distributor could be found or you denied the permission for showing notifications. Please go to the app settings and allow notifications and go to https://unifiedpush.org/users/distributors and setup any of the listed distributors. Then re-open this app and you should be able to enable notifications
ru: Не найден распределитель UnifiedPush или вы запретили показ уведомлений. Пожалуйста, перейдите в настройки приложения и разрешите уведомления, а затем перейдите на https://unifiedpush.org/users/distributors и настройте любого из перечисленных распределителей. Затем снова откройте приложение, и вы сможете включить уведомления

# globalOptionsPushNotificationsDistributor
source: UnifiedPush Distributor
ru: Распределитель UnifiedPush

# globalOptionsPushNotificationsDistributorFirebaseEmbedded
source: Firebase (proprietary)
ru: Firebase (проприетарный)

# globalOptionsPushNotificationsDistributorFCMUP
source: FCM-UP (proprietary)
ru: FCM-UP (проприетарный)

# globalOptionsStartupMinimized
source: Start minimized
ru: Запуск свернутым

# globalOptionsStartupMinimizeInsteadOfExit
source: Minimize instead of exit
ru: Свернуть вместо выхода

# globalOptionsAccountsRememberLastUsedAccount
source: Remember last used account
ru: Запоминать последний использованный аккаунт

# globalOptionsAccountsInitialAccount
source: Initial account
ru: Начальный аккаунт

# globalOptionsAccountsAdd
source: Add account
ru: Добавить аккаунт

# globalOptionsNavigationMode
source: Navigation mode
ru: Режим навигации

# globalOptionsNavigationModeDrawer
source: Drawer
ru: Шторка

# accountOptionsRemove
source: Remove account
ru: Удалить аккаунт

# accountOptionsRemoveConfirm
source: Are you sure you want to remove the account {id}?
ru: Вы уверены, что хотите удалить аккаунт {id}?

# accountOptionsCategoryStorageInfo
source: Storage info
ru: Информация о хранилище

# accountOptionsQuotaUsedOf
source: {used} used of {total} ({relative}%)
ru: {used} использовано из {total} ({relative}%)

# accountOptionsInitialApp
source: App to show initially
ru: Приложение для первоначального показа

# accountOptionsAutomatic
source: Automatic
ru: Автоматически

source: Licenses
ru: Лицензии

source: Source code
ru: Исходный код

# issueTracker
source: Report a bug or request a feature
ru: Сообщить о баге или запросить функцию

# relativeTimeNow
source: now
ru: сейчас

# relativeTimePast
source: {time} ago
ru: {time} назад

# relativeTimeFuture
source: in {time}
ru: через {time}

# relativeTimeMinutes
source: {time} {time,plural, =1{minute}other{minutes}}
ru: {time} {time, plural, one {минута} few {минуты} other {минут}}

# relativeTimeHours
source: {time} {time,plural, =1{hour}other{hours}}
ru: {time} {time, plural, one {час} few {часа} other {часов}}

# relativeTimeDays
source: {time} {time,plural, =1{day}other{days}}
ru: {time} {time, plural, one {день} few {дня} other {дней}}

# relativeTimeYears
source: {time} {time,plural, =1{year}other{years}}
ru: {time} {time, plural, one {год} few {года} other {лет}}
